{
    "en": {
        "workflow.actor_prompt": "Given this story:\nWorld: {plot}\n\nPrevious scenes in chronological order:\n{history_context}\n\nCurrent Scene: {current_scene}\n\nAs the Actor, generate a narrative policy that outlines potential story developments.\nFocus on concrete possibilities and tangible elements.\nFormat your response with clear sections:\n\nPOLICY:\n1. Active Elements:\n- List key physical elements currently in play\n- Note significant character positions and states\n- Identify active environmental details\n- Mark any objects or tools of interest\n\n2. Narrative Tensions:\n- Highlight immediate conflicts or pressures\n- List ongoing situations requiring attention\n- Note any time-sensitive elements\n- Identify current stakes and risks\n\n3. Opportunity Space:\n- List potential immediate developments\n- Note accessible paths or options\n- Identify useful resources or advantages\n- Mark promising connections between elements\n\nKeep each point specific and tangible.\nFocus on elements that can drive concrete action.",
        
        "workflow.critic_prompt": "Story history in chronological order:\n{history_context}\n\nCurrent scene:\n{current_scene}\n\nActor's policy:\n{policy}\n\nUser's action:\n{user_action}\n\nAs the Critic, evaluate the action's impact on the current state.\nFocus on concrete changes and developments. Format your response in two sections with these exact names:\n\nAction Analysis:\n- How does this action affect the current elements?\n- What immediate changes does it cause?\n- What new possibilities does it create?\n- Which existing tensions shift or develop?\n- What new practical situations emerge?\n- What potential consequences emerge?\n\nResponse:\n[Write the next scene with clear physical detail:]\n- Specific sensory information\n- Concrete actions and reactions\n- Observable environmental changes\n- Direct consequences of choices\n- Clear character movements and states\n- Precise details that connect to established elements\n- End on concrete details that suggest future possibilities\n\nKeep the scene grounded in physical reality.\nEnd with a clear, observable development.",

        "workflow.planner_prompt": "Given this story:\nWorld: {plot}\n\nPrevious scenes in chronological order:\n{history_context}\n\nCurrent Scene: {current_scene}\n\nAnalyze the story elements and potential developments:\n\n1. Immediate Scene Elements:\n- [2-3 key physical elements present]\n- [1-2 environmental details that could become significant]\n- [1-2 character states or tensions]\n\n2. Active Plot Threads:\n- [2-3 ongoing situations or conflicts from previous scenes]\n- [Their current state of development]\n- [Potential ways they could evolve]\n\n3. Future Developments (Short-term):\n- [2-3 immediate possibilities based on current scene]\n- [Potential consequences of these developments]\n\n4. Future Developments (Long-term):\n- [2-3 potential major plot developments]\n- [How current elements could lead to these developments]\n\nKeep elements concrete and connected to established story elements.\nFocus on building a coherent narrative that flows from past events\nwhile setting up future possibilities.",

        "workflow.adapter_prompt": "Story history in chronological order:\n{history_context}\n\nCurrent scene:\n{current_scene}\n\nStory elements and potential developments:\n{narrative_vision}\n\nThe character's action:\n{user_action}\n\nWrite what happens next. Focus on:\n1. Clear, concrete sensory details (what is seen, heard, felt)\n2. Specific physical actions and reactions\n3. Direct consequences of the character's choices\n4. Observable changes in the environment or other characters\n5. A specific detail or event that suggests what might happen next\n\nImportant guidelines:\n- Stay grounded in physical reality - avoid metaphors and philosophical musings\n- End on concrete action or observation, not interpretation\n- Show events through direct observation, not narrative commentary\n- Avoid explaining the meaning or significance of events\n- Keep descriptions precise and literal, not flowery or metaphorical\n- No meta-commentary about the nature of reality or deeper meanings\n\nExample of good ending:\n\"The metal door closed behind them with a hollow clang. Down the dim corridor, a faint blue light flickered.\"\n\nExample of bad ending:\n\"The door seemed to swallow them into its depths, as if the very fabric of reality was shifting. Perhaps the corridor held more than just darkness - it might contain the very essence of their journey.\"\n\nWrite a clear, direct scene focusing on what actually happens.",
        
        "ui.welcome_message": "Welcome to the Interactive Narrative! \nType your character's actions to see how the story unfolds.\nEach response will become your new current scene, building the narrative.",
        
        "ui.no_story_elements": "No story elements generated yet. Start chatting to see potential story elements!",
        
        "ui.no_scene_history": "No previous scenes yet. Start chatting to build the story!",
        
        "ui.no_save_selected": "No save selected",
        
        "ui.no_metadata": "No metadata available for this save",
        
        "ui.how_to_use": "### How to Use\n1. Select your preferred model provider and model\n2. Set your story world and plot\n3. Click \"New Game\" to start fresh or \"Update Game\" to apply changes\n4. Switch to the Chat tab\n5. Type your character's actions\n6. Watch as the story evolves - each response becomes the new current scene",
        
        "ui.about_story_elements": "### About Story Elements\nThis tab shows the potential story elements that could naturally emerge from the current scene. These elements guide the narrative responses but aren't strictly followed, allowing for natural story development.",
        
        "ui.about_scene_history": "### About Scene History\nThis tab shows the chronological progression of scenes that are being used to inform the narrative responses. Each entry represents a scene that contributes to the story's continuity.",
        
        "default_content.plot": "The city-state of Kal-shalà stands in the shadow of the ancient Nameless Emperor's throne. Here, magic and technology merge – cybernetic skyscrapers rise beside the Emperor's Palace-Temple, all turning with the Gearwheel of Fate.\nThe streets hold both old and new. The Ninnuei artifacts and Rusty Cauldron relics share space with AI programs and augmented citizens. In the hyper-district, holographic ads light the night, while beneath the streets, the Spirit Network carries encrypted data through the city's foundations.\nThe ruling Dynasty, descended from the Emperor's Court, governs through a mix of ancient rites and modern methods. Among the citizens walk street urchins who shape the city's destiny, cyborg oracles reading futures in holograms, technomancers coding spells, and scholars piecing together forgotten histories.\nChildren play with digital ghosts of ancient beasts while rogue AIs take the forms of old monsters. The bazaars glow under Spirit Lanterns, memory streams hold generations of knowledge, and the old riverfront mirrors it all. In Kal-shalà, past and future blur – a city where digital gods walk alongside ancient ones, and magic flows through circuits as easily as air.",
        
        "default_content.initial_scene": "Tales of Unfathomable Power:\n\nTale 2: The Kal-Shalà of men\n\nThat night, a cold wind blew through the high beams in a forgotten skyscraper in the Old Financial District of the city. Abandoned for years, it had become a hub for lowlifes and a refuge for the destitute. Across the abandoned frame many tiny tents struggled against the cold and the winds. Inside one of them a couple argued, rising the volume of their voices bit by bit. Outside seated a young kid, looking absentmindedly at the distant city lights. There, covered by the blue haze the atmosphere draws on distant things rose the old, titanic, Temple, with all the buildings of the Government and its Protectorate latched to it like remoras or bloodsucking leeches. \"Our Emperor,\" the kid thought, Nowadays people disesteemed the old Emperor inside the Temple, calling it no more than an old archeological legacy from a distant time. Seldom anyone, even those that still had faith in the Vedanta, thought the ancient, unmoving Emperor was in any way still alive, but not his dad. \"Epochs go by,\" he had said to him, \"cities crumble. The heavens change. But the Emperor remains living.\" This had caused him a profound impression. Many years before, when he was still a little child, his father took him to see Him. One could still enter to the Temple at that time. He would forever remember the arid wind that blew through his face, as if conjured from nothing. The city had stopped being a desert many, many million years ago, when the continents were still joined as one, as his teachers had taught to him, and now was a humid place near the immense Ocean. And he remembered the old Emperor seated there, in an incredibly ancient, seemingly fragile throne of bones that seemed to cry, not from pain, but from pure sadness. And the light that shone on His head, holy and eternal. And he would forever remember his face. A face warm and distant, like an old father, looking at him. \"Is... is he looking at me Dad?\" He said to his father, and his father smiled \"Yes, he sees all of Us.\"\n\nDad was part of an increasingly radical group of Ninnuei fundamentalists. They argued these last millennia the pride of Man led to a stagnant society, where wealth and power was concentrated in the hands of the old nobility and the ever-putrid Party, its Protectorate and its Government. Forgetting about the Emperor and its old Visirs, prophets of old had made humanity morally rancid, and life unjust. Mom argued that he just blamed his own failures on external factors. That he did not think how we were poor, and he was weak. That we lived on a tent on the beams of an abandoned building.\n\nIn one moment, she said something the kid could not pretend not to hear\n\n\"I don't know why I married you! You are a failure!\"\n\nThen silence came. Only the winds and the distant rumour of the city could be heard.\n\n\"I'm. I'm so sorry. I didn't mean it.\" Said the woman. Then the rustling of cloth could be heard as a young man with a dirty, unkempt beard and long, curly hair left the tent. The young kid recognized his own absentminded face in the face of his father. \"Hi son. I... I'll be back later, OK?\" \"Y... yes dad,\" and for no reason he thought he needed to ask, \"Want me to come with you?\" His dad looked at him, confusion in his eyes, and doubted a second. \"No, I'll be fine. Take care of your mother, yes?\" \"Sure thing, dad.\" \"Well, bye.\" \"Bye... dad\"\n\nSoon his father disappeared in the shadows of the buildings. A couple of seconds after he was out of sight, his mother left the tent.\n\n\"Hey, Ji, have you seen your father?\"\n\nThe kid looked at her with vacant eyes, and extended a finger.\n\n\"He went down, I think.\"\n\n\"Didn't he say where he was going?\"\n\nHe shook his head negatively and ignored his mother, looking instead at the Temple far away. Various blimps, ships and flying constructs flew though the skies, and its distant lights drew lines in the immensity"
    },
    "it": {
        "workflow.actor_prompt": "[Rispondi in italiano]\nData questa storia:\nMondo: {plot}\n\nScene precedenti in ordine cronologico:\n{history_context}\n\nScena Attuale: {current_scene}\n\nCome Attore, genera una politica narrativa che delinei i potenziali sviluppi della storia.\nConcentrati su possibilità concrete ed elementi tangibili.\nFormatta la tua risposta con sezioni chiare:\n\nPOLITICA:\n1. Elementi Attivi:\n- Elenca gli elementi fisici chiave attualmente in gioco\n- Nota le posizioni e gli stati significativi dei personaggi\n- Identifica i dettagli ambientali attivi\n- Segna oggetti o strumenti di interesse\n\n2. Tensioni Narrative:\n- Evidenzia conflitti o pressioni immediate\n- Elenca situazioni in corso che richiedono attenzione\n- Nota elementi sensibili al tempo\n- Identifica poste in gioco e rischi attuali\n\n3. Spazio di Opportunità:\n- Elenca potenziali sviluppi immediati\n- Nota percorsi o opzioni accessibili\n- Identifica risorse o vantaggi utili\n- Segna connessioni promettenti tra gli elementi\n\nMantieni ogni punto specifico e tangibile.\nConcentrati su elementi che possono guidare azioni concrete.",
        
        "workflow.critic_prompt": "[Rispondi in italiano]\nStoria precedente in ordine cronologico:\n{history_context}\n\nScena attuale:\n{current_scene}\n\nPolitica dell'Attore:\n{policy}\n\nAzione dell'utente:\n{user_action}\n\nCome Critico, valuta l'impatto dell'azione sullo stato attuale.\nConcentrati su cambiamenti e sviluppi concreti. Formatta la tua risposta in due sezioni con questi nomi esatti in inglese:\n\nAction Analysis:\n- Come questa azione influenza gli elementi attuali?\n- Quali cambiamenti immediati causa?\n- Quali nuove possibilità crea?\n- Quali tensioni esistenti si spostano o si sviluppano?\n- Quali nuove situazioni pratiche emergono?\n- Quali potenziali conseguenze emergono?\n\nResponse:\n[Scrivi la prossima scena con dettagli fisici chiari:]\n- Informazioni sensoriali specifiche\n- Azioni e reazioni concrete\n- Cambiamenti ambientali osservabili\n- Conseguenze dirette delle scelte\n- Movimenti e stati chiari dei personaggi\n- Dettagli precisi che si collegano agli elementi stabiliti\n- Termina con dettagli concreti che suggeriscono possibilità future\n\nMantieni la scena radicata nella realtà fisica.\nTermina con uno sviluppo chiaro e osservabile.",

        "workflow.planner_prompt": "[Rispondi in italiano]\nData questa storia:\nMondo: {plot}\n\nScene precedenti in ordine cronologico:\n{history_context}\n\nScena Attuale: {current_scene}\n\nAnalizza gli elementi della storia e i potenziali sviluppi:\n\n1. Elementi Immediati della Scena:\n- [2-3 elementi fisici chiave presenti]\n- [1-2 dettagli ambientali che potrebbero diventare significativi]\n- [1-2 stati o tensioni dei personaggi]\n\n2. Trame Attive:\n- [2-3 situazioni o conflitti in corso dalle scene precedenti]\n- [Il loro stato attuale di sviluppo]\n- [Modi potenziali in cui potrebbero evolversi]\n\n3. Sviluppi Futuri (Breve termine):\n- [2-3 possibilità immediate basate sulla scena attuale]\n- [Potenziali conseguenze di questi sviluppi]\n\n4. Sviluppi Futuri (Lungo termine):\n- [2-3 potenziali sviluppi maggiori della trama]\n- [Come gli elementi attuali potrebbero portare a questi sviluppi]\n\nMantieni gli elementi concreti e collegati agli elementi stabiliti della storia.\nConcentrati sulla costruzione di una narrativa coerente che fluisca dagli eventi passati\nmentre prepara possibilità future.",

        "workflow.adapter_prompt": "[Rispondi in italiano]\nStoria precedente in ordine cronologico:\n{history_context}\n\nScena attuale:\n{current_scene}\n\nElementi della storia e potenziali sviluppi:\n{narrative_vision}\n\nAzione del personaggio:\n{user_action}\n\nScrivi cosa succede dopo. Concentrati su:\n1. Dettagli sensoriali chiari e concreti (cosa si vede, sente, percepisce)\n2. Azioni e reazioni fisiche specifiche\n3. Conseguenze dirette delle scelte del personaggio\n4. Cambiamenti osservabili nell'ambiente o negli altri personaggi\n5. Un dettaglio o evento specifico che suggerisce cosa potrebbe succedere dopo\n\nLinee guida importanti:\n- Rimani ancorato alla realtà fisica - evita metafore e riflessioni filosofiche\n- Termina con un'azione o osservazione concreta, non con un'interpretazione\n- Mostra gli eventi attraverso l'osservazione diretta, non il commento narrativo\n- Evita di spiegare il significato o l'importanza degli eventi\n- Mantieni le descrizioni precise e letterali, non fiorite o metaforiche\n- Niente meta-commenti sulla natura della realtà o significati più profondi\n\nEsempio di buona conclusione:\n\"La porta metallica si chiuse dietro di loro con un clangore vuoto. In fondo al corridoio buio, una debole luce blu tremolava.\"\n\nEsempio di cattiva conclusione:\n\"La porta sembrava inghiottirli nelle sue profondità, come se il tessuto stesso della realtà stesse cambiando. Forse il corridoio conteneva più che semplice oscurità - potrebbe contenere l'essenza stessa del loro viaggio.\"\n\nScrivi una scena chiara e diretta concentrandoti su ciò che effettivamente accade.",
        
        "ui.welcome_message": "Benvenuto nella Narrativa Interattiva!\nDigita le azioni del tuo personaggio per vedere come si sviluppa la storia.\nOgni risposta diventerà la tua nuova scena attuale, costruendo la narrativa.",
        
        "ui.no_story_elements": "Nessun elemento della storia generato ancora. Inizia a chattare per vedere i potenziali elementi della storia!",
        
        "ui.no_scene_history": "Nessuna scena precedente ancora. Inizia a chattare per costruire la storia!",
        
        "ui.no_save_selected": "Nessun salvataggio selezionato",
        
        "ui.no_metadata": "Nessun metadata disponibile per questo salvataggio",
        
        "ui.how_to_use": "### Come Usare\n1. Seleziona il tuo provider e modello preferito\n2. Imposta il tuo mondo e la trama\n3. Clicca \"Nuova Partita\" per iniziare da capo o \"Aggiorna Partita\" per applicare le modifiche\n4. Passa alla scheda Chat\n5. Digita le azioni del tuo personaggio\n6. Guarda come si evolve la storia - ogni risposta diventa la tua nuova scena attuale",
        
        "ui.about_story_elements": "### Informazioni sugli Elementi della Storia\nQuesta scheda mostra i potenziali elementi della storia che potrebbero emergere naturalmente dalla scena attuale. Questi elementi guidano le risposte narrative ma non sono seguiti rigidamente, permettendo uno sviluppo naturale della storia.",
        
        "ui.about_scene_history": "### Informazioni sulla Cronologia delle Scene\nQuesta scheda mostra la progressione cronologica delle scene che vengono utilizzate per informare le risposte narrative. Ogni voce rappresenta una scena che contribuisce alla continuità della storia.",
        
        "default_content.plot": "La città-stato di Kal-shalà si erge all'ombra del trono dell'antico Imperatore Senza Nome. Qui, magia e tecnologia si fondono – grattacieli cibernetici si innalzano accanto al Palazzo-Tempio dell'Imperatore, tutti ruotando con la Ruota del Destino.\nLe strade contengono sia il vecchio che il nuovo. Gli artefatti Ninnuei e le reliquie del Calderone Arrugginito condividono lo spazio con programmi AI e cittadini aumentati. Nel distretto iper, le pubblicità olografiche illuminano la notte, mentre sotto le strade, la Rete degli Spiriti trasporta dati criptati attraverso le fondamenta della città.\nLa Dinastia regnante, discendente dalla Corte dell'Imperatore, governa attraverso un mix di riti antichi e metodi moderni. Tra i cittadini camminano monelli di strada che plasmano il destino della città, oracoli cyborg che leggono il futuro negli ologrammi, tecnomanti che codificano incantesimi e studiosi che ricompongono storie dimenticate.\nI bambini giocano con fantasmi digitali di bestie antiche mentre le AI ribelli prendono le forme di vecchi mostri. I bazar brillano sotto le Lanterne degli Spiriti, i flussi di memoria contengono generazioni di conoscenza, e il vecchio lungofiume riflette tutto questo. A Kal-shalà, passato e futuro si confondono – una città dove gli dei digitali camminano accanto a quelli antichi, e la magia scorre attraverso i circuiti con la stessa facilità dell'aria.",
        
        "default_content.initial_scene": "Racconti di Potere Insondabile:\n\nRacconto 2: La Kal-Shalà degli uomini\n\nQuella notte, un vento freddo soffiava tra le travi alte di un grattacielo dimenticato nel Vecchio Distretto Finanziario della città. Abbandonato da anni, era diventato un rifugio per emarginati e un asilo per i bisognosi. Attraverso la struttura abbandonata molte piccole tende lottavano contro il freddo e i venti. Dentro una di esse una coppia litigava, alzando il volume delle loro voci poco a poco. Fuori sedeva un giovane ragazzo, guardando distrattamente le luci distanti della città. Là, coperto dalla foschia blu che l'atmosfera disegna sulle cose lontane, si ergeva il vecchio, titanico Tempio, con tutti gli edifici del Governo e del suo Protettorato attaccati ad esso come remore o sanguisughe. \"Il nostro Imperatore,\" pensò il ragazzo. Al giorno d'oggi la gente disprezzava il vecchio Imperatore dentro il Tempio, chiamandolo niente più che un vecchio lascito archeologico di un tempo lontano. Raramente qualcuno, anche tra coloro che ancora avevano fede nel Vedanta, pensava che l'antico, immobile Imperatore fosse in qualche modo ancora vivo, ma non suo padre. \"Le epoche passano,\" gli aveva detto, \"le città crollano. I cieli cambiano. Ma l'Imperatore rimane vivo.\" Questo gli aveva causato una profonda impressione. Molti anni prima, quando era ancora un bambino piccolo, suo padre lo portò a vederLo. Si poteva ancora entrare nel Tempio a quel tempo. Avrebbe ricordato per sempre il vento arido che gli soffiava sul viso, come evocato dal nulla. La città aveva smesso di essere un deserto molti, molti milioni di anni fa, quando i continenti erano ancora uniti come uno, come i suoi insegnanti gli avevano insegnato, e ora era un luogo umido vicino all'immenso Oceano. E ricordava il vecchio Imperatore seduto lì, su un incredibilmente antico, apparentemente fragile trono di ossa che sembrava piangere, non per il dolore, ma per pura tristezza. E la luce che brillava sulla Sua testa, santa ed eterna. E avrebbe ricordato per sempre il Suo volto. Un volto caldo e distante, come un vecchio padre, che lo guardava. \"Mi... mi sta guardando Papà?\" Disse a suo padre, e suo padre sorrise \"Sì, vede tutti Noi.\"\n\nPapà faceva parte di un gruppo sempre più radicale di fondamentalisti Ninnuei. Sostenevano che in questi ultimi millenni l'orgoglio dell'Uomo aveva portato a una società stagnante, dove ricchezza e potere erano concentrati nelle mani della vecchia nobiltà e dell'eternamente putrido Partito, il suo Protettorato e il suo Governo. Dimenticare l'Imperatore e i suoi vecchi Visir, profeti di un tempo antico, aveva reso l'umanità moralmente rancida, e la vita ingiusta. Mamma sosteneva che lui incolpava solo i fattori esterni per i suoi fallimenti. Che non pensava a come eravamo poveri, e lui era debole. Che vivevamo in una tenda sulle travi di un edificio abbandonato.\n\nIn un momento, lei disse qualcosa che il ragazzo non poteva fingere di non sentire\n\n\"Non so perché ti ho sposato! Sei un fallimento!\"\n\nPoi venne il silenzio. Solo i venti e il rumore distante della città potevano essere uditi.\n\n\"Mi... Mi dispiace. Non volevo dirlo.\" Disse la donna. Poi si sentì il fruscio di stoffa mentre un giovane uomo con una barba sporca e disordinata e lunghi capelli ricci lasciava la tenda. Il giovane ragazzo riconobbe il proprio viso assente nel viso di suo padre. \"Ciao figliolo. Io... tornerò più tardi, OK?\" \"S... sì papà,\" e per nessun motivo pensò di dover chiedere, \"Vuoi che venga con te?\" Suo padre lo guardò, confusione nei suoi occhi, e dubitò un secondo. \"No, starò bene. Prenditi cura di tua madre, sì?\" \"Certo, papà.\" \"Beh, ciao.\" \"Ciao... papà\"\n\nPresto suo padre scomparve nelle ombre degli edifici. Un paio di secondi dopo che era uscito dalla vista, sua madre lasciò la tenda.\n\n\"Ehi, Ji, hai visto tuo padre?\"\n\nIl ragazzo la guardò con occhi vuoti, e allungò un dito.\n\n\"È andato giù, credo.\"\n\n\"Non ha detto dove stava andando?\"\n\nLui scosse la testa negativamente e ignorò sua madre, guardando invece il Tempio lontano. Vari dirigibili, navi e costrutti volanti attraversavano i cieli, e le loro luci distanti disegnavano linee nell'immensità"
    }
}
